Res-Latency-hotel-1profile/Res-container-random-v1/container_t_10_c_30_frontCore_4_wrkCore_1_R_400/wrk.txt
Running 1m test @ http://128.226.119.92:5000
  10 threads and 30 connections
  Thread calibration: mean lat.: 3.679ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 3.712ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 3.528ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 3.541ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 3.843ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 3.628ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 3.580ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 3.733ms, rate sampling interval: 12ms
  Thread calibration: mean lat.: 3.711ms, rate sampling interval: 13ms
  Thread calibration: mean lat.: 3.599ms, rate sampling interval: 12ms
  Thread Stats   Avg      Stdev     99%   +/- Stdev
    Latency     3.52ms    2.00ms   9.34ms   65.11%
    Req/Sec    41.25     58.01   230.00     91.10%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    3.15ms
 75.000%    4.75ms
 90.000%    6.32ms
 99.000%    9.34ms
 99.900%   11.53ms
 99.990%   13.71ms
 99.999%   15.83ms
100.000%   15.83ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.500     0.000000            1         1.00
       1.341     0.100000         1990         1.11
       1.568     0.200000         3981         1.25
       2.022     0.300000         5970         1.43
       2.805     0.400000         7958         1.67
       3.155     0.500000         9949         2.00
       3.327     0.550000        10946         2.22
       3.545     0.600000        11936         2.50
       3.917     0.650000        12930         2.86
       4.387     0.700000        13928         3.33
       4.751     0.750000        14932         4.00
       4.947     0.775000        15418         4.44
       5.155     0.800000        15915         5.00
       5.415     0.825000        16416         5.71
       5.671     0.850000        16914         6.67
       5.963     0.875000        17405         8.00
       6.135     0.887500        17659         8.89
       6.323     0.900000        17907        10.00
       6.531     0.912500        18151        11.43
       6.743     0.925000        18401        13.33
       7.023     0.937500        18650        16.00
       7.187     0.943750        18773        17.78
       7.355     0.950000        18897        20.00
       7.515     0.956250        19022        22.86
       7.735     0.962500        19147        26.67
       7.971     0.968750        19270        32.00
       8.139     0.971875        19334        35.56
       8.311     0.975000        19395        40.00
       8.455     0.978125        19458        45.71
       8.655     0.981250        19521        53.33
       8.895     0.984375        19581        64.00
       8.967     0.985938        19612        71.11
       9.087     0.987500        19643        80.00
       9.231     0.989062        19675        91.43
       9.423     0.990625        19705       106.67
       9.623     0.992188        19736       128.00
       9.735     0.992969        19752       142.22
       9.887     0.993750        19767       160.00
      10.039     0.994531        19783       182.86
      10.167     0.995313        19798       213.33
      10.327     0.996094        19814       256.00
      10.407     0.996484        19822       284.44
      10.583     0.996875        19830       320.00
      10.703     0.997266        19837       365.71
      10.855     0.997656        19846       426.67
      10.959     0.998047        19853       512.00
      11.039     0.998242        19858       568.89
      11.111     0.998437        19860       640.00
      11.263     0.998633        19866       731.43
      11.335     0.998828        19868       853.33
      11.591     0.999023        19872      1024.00
      11.655     0.999121        19874      1137.78
      11.863     0.999219        19876      1280.00
      12.031     0.999316        19878      1462.86
      12.359     0.999414        19880      1706.67
      12.535     0.999512        19882      2048.00
      12.767     0.999561        19883      2275.56
      12.775     0.999609        19884      2560.00
      12.791     0.999658        19885      2925.71
      13.135     0.999707        19886      3413.33
      13.335     0.999756        19887      4096.00
      13.335     0.999780        19887      4551.11
      13.631     0.999805        19888      5120.00
      13.631     0.999829        19888      5851.43
      13.711     0.999854        19889      6826.67
      13.711     0.999878        19889      8192.00
      13.711     0.999890        19889      9102.22
      15.311     0.999902        19890     10240.00
      15.311     0.999915        19890     11702.86
      15.311     0.999927        19890     13653.33
      15.311     0.999939        19890     16384.00
      15.311     0.999945        19890     18204.44
      15.831     0.999951        19891     20480.00
      15.831     1.000000        19891          inf
#[Mean    =        3.521, StdDeviation   =        1.997]
#[Max     =       15.824, Total count    =        19891]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  23853 requests in 1.00m, 9.84MB read
Requests/sec:    397.50
Transfer/sec:    167.95KB